# برنامج اذكار الصباح 🤍🌺
Start = 0
print("اذكار الصباح 🤍🌺", "\n")
print (	"تعليمات:		")
print ("هذا البرنامج يشمل 23 ذكرآ\n")
print ("قم بضغط مفتاح Enter لعد مرات التسبيح ")
print ("\nعدد مرات قول هذا الذكر : مرة واحدة")


#########

#الذكر رقم 1

print("(الحمد لله وحده، والصلاة والسلام على من لا نبي بعده)")

print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")

while(input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 1):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break
	
#الذكر رقم 2

print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")

print ("\nعدد مرات قول هذا الذكر : مرة واحدة\n")

print ("الله لا اله الا هو الحي القيوم لاتأخذه سنة ولا نوم له مافي السموات ومافي الارض من ذا الذي يشفع عنده الا بإذنه يعلم ما بين ايديهم وما خلفهم ولا يحيطون بشيء من علمه الا بما شاء وسع كرسيه السموات والارض ولا يؤده حفظهما وهو العلي العظيم \n")






while (input() != 1):
		Start = Start + 1
		print("عدد تكرار الذكر ❤: ", Start)
		if (Start == 1):
			print ("» عدد الحسنات:  ", Start)
			Start = 0
			break

#الذكر رقم 3

print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")

print ("عدد مرات قول هذا الذكر : 3 مرات\n")



print (" بسم الله الرحمن الرحيم ﴿قل هو الله أحد* الله الصمد* لم يلد ولم يولد* ولم يكن له كفوا أحد﴾.")
print ("\n")
print ("بسم الله الرحمن الرحيم ﴿قل أعوذ برب الفلق* من شر ما خلق* ومن شر غاسق إذا وقب* ومن شر النفاثات في العقد* ومن شر حاسد إذا حسد﴾.")
print ("\n")
print ("بسم الله الرحمن الرحيم ﴿قل أعوذ برب الناس* ملك الناس* إله الناس* من شر الوسواس الخناس* الذي يوسوس في صدور الناس* من الجنة و الناس﴾")



while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 3):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break
		
		
	#الذكر رقم 4	
	
print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")
		
print ("عدد مرات قول هذا الذكر : 3 مرات\n")

print("أصبحنا وأصبح الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، رب أسألك خير ما في هذا اليوم وخير ما بعده، وأعوذ بك من شر ما في هذا اليوم وشر ما بعده، رب أعوذ بك من الكسل وسوء الكبر، رب أعوذ بك من عذاب في النار وعذاب في القبر")



while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 1):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break
		
		
		
#الذكر رقم 5
		
print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")
print ("عدد قول هذا الذكر : مرة واحدة\n")
print (" اللهم بك أصبحنا، وبك أمسينا، وبك نحيا، وبك نموت وإليك النشور")



while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 1):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break
		
		
#الذكر رقم 6
		
print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")
print ("عدد قول هذا الذكر : مرة واحدة\n")
print ("اللهم انت ربي لا اله الا انت خلقتني وانا عبدك وانا على عهدك ووعدك ما استطعت ،اعوذ بك من شر ما صنعت ابوءُ لك بنعمتك علي وابوء بذنبي فأغفر لي فإنه لا يغفر الذنوب الا انت")




while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 1):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break
		
#الذكر رقم 7

print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")
		
print ("عدد مرات قول هذا الذكر : 3 مرات\n")
print ("اللهم اني اصبحت اشهدك واشهد حملة عرشك وملائكتك وجميع خلقك انك انت الله لا اله الا انت، وحدك لا شريك لك وان محمدآ عبدك ورسوله")

print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")


while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 3):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break
#الذكر رقم 8

print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")

print ("عدد مرات قول هذا الذكر :1 مرات\n")
print ("اللهم ما اصبح بي من نعمة او بأحد من خلقك ، فمنك وحدك لا شريك لك ,فلك الحمد ولك الشكر")

print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")


while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 1):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break

#الذكر رقم 9


print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")


print ("عدد مرات قول هذا الذكر : 3 مرات\n")
print (" اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت. اللهم  إني أعوذ بك من الكفر، والفقر، وأعوذ بك من عذاب القبر، لا إله إلا أنت ")


while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 3):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break


#الذكر رقم 10

print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")



print ("عدد مرات قول هذا الذكر :7 مرات\n")
print ("حسبي الله لا اله الا هو ، عليه توكلت وهو رب العرش العظيم")



while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 7):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break



#الذكر رقم 11

print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")



print ("عدد مرات قول هذا الذكر :مرة واحدة\n")
print ("اللهم اني اسألك العفو والعافية في الدنيا والاخرة ،اللهم اني اسألك العفو والعافية في ديني ونياي واهلي ومالي، اللهم استر عوراتي وامن روعاتي ، اللهم احفظني من بين يدي ،وعن يميني وعن شمالي ,ومن فوقي، واعوذ بعظمتك ان اغتال من تحتي")


while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 1):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break

#الذكر رقم 12

print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")
print ("عدد مرات قول هذا الذكر : مرة واحدة\n")
print ("اللهم عالم الغيب والشهادة، فاطر السموات والارض ، رب كل شيء ومليكه ، اشهد ان لا اله انت, اعوذ بك من شر نفسي ومن شر الشيطان وشركه، وان افترق على نفسي سوءآ او ان اجره الى مسلم ")


while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 3):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break


#الذكر رقم 13


print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")


print ("عدد مرات قول هذا الذكر : 3 مرات\n")
print ("بسم الله الذي لا يضر مع اسمه شيء في الارض ولا في السماء ، وهو السميع العليم")


while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 3):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break


#الذكر رقم 14


print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")


print ("عدد مرات قول هذا الذكر : 3 مرات\n")
print ("رضيت بالله ربآ، وبالإسلام دينآ ،وبمحمد صلى الله عليه وسلم نبيآ")



while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 3):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break	

#الذكر رقم 15

print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")

print ("عدد مرات قول هذا الذكر : 3 مرات\n")
print ("يا حي يا قيوم ،برحمتك استغيث اصلح لي شأني كله ،ولا تكلني الا نفسي طرقة عين")


while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 3):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break


#الذكر رقم 16
print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")


print ("عدد مرات قول هذا الذكر : مرة واحدة\n")
print ("اللهم اني اصبحت اشهدك واشهد حملة عرشك وملائكتك وجميع خلقك انك انت الله لا اله الا انت، وحدك لا شريك لك وان محمدآ عبدك ورسوله")



while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 1):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break

###
## الذكر رقم 17

print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")


print ("عدد مرات قول هذا الذكر : مرة واحدة\n")
print ("اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت. اللهم  إني أعوذ بك من الكفر، والفقر، وأعوذ بك من عذاب القبر، لا إله إلا أنت")



while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 1):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break

##الذكر رقم 18


print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")

print ("عدد مرات قول هذا الذكر : مرة واحدة\n")
print ("أصبحنا على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد صلى الله عليه وسلم، وعلى ملة أبينا إبراهيم، حنيفا مسلما وما كان من المشركين")


while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 1):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break


##الذكر رقم 19

print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")

print ("عدد مرات قول هذا الذكر : 100 مرة\n")
print ("سبحان الله وبحمده")



while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 100):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break



#الذكر رقم 20

print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")

print ("عدد مرات قول هذا الذكر : 100 مرة\n")
print ("استغفر الله العظيم واتوب اليه")


while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 100):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break


#الذكر رقم 21

print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")

print ("عدد مرات قول هذا الذكر : 10 مرات\n")
print ("لا اله الا الله وحده لا شريك له ، له الملك وله الحمد وهو على كل شي قدير")


while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 10):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break



print ("عدد مرات قول هذا الذكر : 3 مرات\n")
print ("سبحان الله وبحمده ،عدد خلقه ورضي نفسه وزنة عرشة ومداد كلماته ")


while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 3):
		print ("\n", "عدد الحسنات:  ", Start)
		Start = 0
		break


#الذكر رقم 22


print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")


print ("عدد مرات قول هذا الذكر : 3 مرات\n")
print ("اللهم اني اسألك علمآ نافعآ، ورزقآ طيبآ، وعملآ متقبلآ")



while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 3):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break

#الذكر رقم 23

print ("\n		  	♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡")

print ("عدد مرات قول هذا الذكر :10 مرات\n")
print ("اللهم صلي وسلم وبارك على سيدنا محمد")



while (input() != 1):
	Start = Start + 1
	print("عدد تكرار الذكر ❤: ", Start)
	if (Start == 10):
		print ("» عدد الحسنات:  ", Start)
		Start = 0
		break

		
print ("\n")		
print ("🤍🌺 ان الذكر تنفع المؤمنين والحمد الله لوصولك الى هنا")
